In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split

from sklearn.naive_bayes import GaussianNB

In [2]:
#Set the path and read the data from the file

df = pd.read_csv("Titanic.csv")
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
# dropping unwanted data

df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns',inplace=True)

df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
# Seperate the data 

target=df.Survived
input=df.drop('Survived',axis='columns')

In [5]:
# getting boolean output for gender

dummies = pd.get_dummies(input.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [6]:
# merge gender to data set

input = pd.concat([input,dummies],axis='columns')
input.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [7]:
# Drop the "sex" column

input.drop('Sex',axis='columns',inplace=True)
input.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [8]:
# Checking not number columns
# isna - is not a value

input.columns[input.isna().any()]

Index(['Age'], dtype='object')

In [9]:
# checking not number value

input.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
# Replace a not number value from a mean age
# fillna - fill not a number

input.Age = input.Age.fillna(input.Age.mean())
input.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [11]:
# split the data set for training and testing
# Testing - 20% # Training - 80%

X_train, X_test, y_train, y_test = train_test_split(input,target,test_size=0.2)

In [12]:
# Length of a Train data set

len(X_train)

712

In [13]:
# Length of the Test data set

len(X_test)

179

In [14]:
# Training data set

X_train

     Pclass        Age     Fare  female  male
75        3  25.000000   7.6500       0     1
364       3  29.699118  15.5000       0     1
151       1  22.000000  66.6000       1     0
829       1  62.000000  80.0000       1     0
572       1  36.000000  26.3875       0     1
..      ...        ...      ...     ...   ...
174       1  56.000000  30.6958       0     1
676       3  24.500000   8.0500       0     1
56        2  21.000000  10.5000       1     0
317       2  54.000000  14.0000       0     1
552       3  29.699118   7.8292       0     1

[712 rows x 5 columns]

In [15]:
# Gausian NB - since different values are there

model = GaussianNB()

In [16]:
model.fit(X_train, y_train)

GaussianNB()

In [17]:
# Accuracy score

print("Accuracy : ",  model.score(X_test,y_test))

Accuracy :  0.7597765363128491

In [18]:
#Tested data
X_test[:10]

     Pclass        Age      Fare  female  male
487       1  58.000000   29.7000       0     1
124       1  54.000000   77.2875       0     1
804       3  27.000000    6.9750       0     1
783       3  29.699118   23.4500       0     1
171       3   4.000000   29.1250       0     1
651       2  18.000000   23.0000       1     0
499       3  24.000000    7.7958       0     1
195       1  58.000000  146.5208       1     0
409       3  29.699118   25.4667       1     0
148       2  36.500000   26.0000       0     1

In [19]:
y_test[:10]

487    0
124    0
804    1
783    0
171    0
651    1
499    0
195    1
409    0
148    0
Name: Survived, dtype: int64

In [20]:
#Assign to a Array and Check with Predicted Data

model.predict(X_test[:10])

array([0, 0, 0, 0, 0, 1, 0, 1, 1, 0])

In [21]:
model.predict_proba(X_test[:10])

array([[9.27253311e-01, 7.27466892e-02],
       [7.60995028e-01, 2.39004972e-01],
       [9.89387194e-01, 1.06128058e-02],
       [9.89669422e-01, 1.03305777e-02],
       [9.77852517e-01, 2.21474827e-02],
       [1.24741457e-02, 9.87525854e-01],
       [9.88763012e-01, 1.12369878e-02],
       [7.26772164e-06, 9.99992732e-01],
       [3.32641040e-02, 9.66735896e-01],
       [9.79568703e-01, 2.04312973e-02]])